sdaiCreateNestedAggrByIndexADB(Sdai_Id_aggr*,System.UInt32,Sdai_ADBId*)
\details
Creates a nested aggregate instance stored in an attribute data block
within a specified aggregate instance at the position specified by the index.
\param aggregate       [in] An aggregate instance that contains the created nested aggregate.
\param index           [in] An index that determines the position of the created item.
\param selaggrInstance [in] An attribute data block instance that defines the type of the SELECT value.
\returns The identifier of the newly created aggregate instance.
\code
SdaiADB lineIndex = sdaiCreateEmptyADB();
SdaiString  lineIndexPath[] = { "ifclineindex" };
sdaiPutADBTypePath(lineIndex, 1, lineIndexPath);
SdaiAggr lineIndexAggr = sdaiCreateNestedAggrByIndexADB(segments, 0, lineIndex);
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiAI_NVLD - Aggregate instance invalid.
* sdaiIX_NVLD - Index invalid.
* sdaiVA_NSET - Value not set.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiSY_ERR - Underlying system error.